---
kind: method
id: M:Autodesk.Revit.DB.HasValueFilterRule.#ctor(Autodesk.Revit.DB.ElementId)
source: html/89208215-a050-1e71-6cad-89eb933c2cc5.htm
---
# Autodesk.Revit.DB.HasValueFilterRule.#ctor Method

constructs an instance of HasValueFilterRule.

## Syntax (C#)
```csharp
public HasValueFilterRule(
	ElementId parameter
)
```

## Parameters
- **parameter** (`Autodesk.Revit.DB.ElementId`) - The parameter that an element must have a value for to pass this rule.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null